Revit 2026 API

# BuiltInFailuresSculptingFailures Class

---

Failures about Sculpting.

SystemObject Autodesk.Revit.DBBuiltInFailuresSculptingFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SculptingFailures
```
```vb
Public NotInheritable Class SculptingFailures
```
```cpp
public ref class SculptingFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SculptingFailures = class end
```

The BuiltInFailuresSculptingFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FaceSculptEditFailed | Face Sculpt Edit failed. |
|  | FaceSculptingFaceLoss | The original sculpted face is lost. |

#### Reference

Autodesk.Revit.DB Namespace